In [1]:
%load_ext sql

In [2]:
%sql sqlite

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [3]:
%sql sqlite://

'Connected: @None'

In [18]:
%%sql
CREATE TABLE COUNTRYNAME(city varchar(50),country varchar(50),season,Temparature);
INSERT INTO COUNTRYNAME VALUES('Munbai','India','Winter', '24.8');
INSERT INTO COUNTRYNAME VALUES('Munbai','India','Spring', '28.4');
INSERT INTO COUNTRYNAME VALUES('Munbai','India','Summer', '27.9');
INSERT INTO COUNTRYNAME VALUES('Munbai', 'India','Fall','27.6');
INSERT INTO COUNTRYNAME VALUES('London', 'United Kingdom', 'Winter', '4.2');
INSERT INTO COUNTRYNAME VALUES('London', 'United Kingdom', 'Spring', '8.3');
INSERT INTO COUNTRYNAME VALUES('London', 'United Kingdom', 'Summer', '15.7');
INSERT INTO COUNTRYNAME VALUES('London', 'United Kingdom', 'Fall', '10.4');
INSERT INTO COUNTRYNAME VALUES('Cairo', 'Egypt', 'Winter', '13.6');
INSERT INTO COUNTRYNAME VALUES('Cairo', 'Egypt', 'Spring', '20.7');
INSERT INTO COUNTRYNAME VALUES('Cairo', 'Egypt', 'Summer', '27.7');
INSERT INTO COUNTRYNAME VALUES('Cairo', 'Egypt', 'Fall', '22.2');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%sql SELECT * from COUNTRYNAME;

 * sqlite://
Done.

[('Munbai', 'India', 'Winter', '24.8'),
 ('Munbai', 'India', 'Spring', '28.4'),
 ('Munbai', 'India', 'Summer', '27.9'),
 ('Munbai', 'India', 'Fall', '27.6'),
 ('London', 'United Kingdom', 'Winter', '4.2'),
 ('London', 'United Kingdom', 'Spring', '8.3'),
 ('London', 'United Kingdom', 'Summer', '15.7'),
 ('London', 'United Kingdom', 'Fall', '10.4'),
 ('Cairo', 'Egypt', 'Winter', '13.6'),
 ('Cairo', 'Egypt', 'Spring', '20.7'),
 ('Cairo', 'Egypt', 'Summer', '27.7'),
 ('Cairo', 'Egypt', 'Fall', '22.2')]

In [22]:
%sql ALTER TABLE COUNTRYNAME ADD Rainfall varchar(50);
%sql SELECT * from COUNTRYNAME;

 * sqlite://
Done.
 * sqlite://
Done.

[('Munbai', 'India', 'Winter', '24.8', None),
 ('Munbai', 'India', 'Spring', '28.4', None),
 ('Munbai', 'India', 'Summer', '27.9', None),
 ('Munbai', 'India', 'Fall', '27.6', None),
 ('London', 'United Kingdom', 'Winter', '4.2', None),
 ('London', 'United Kingdom', 'Spring', '8.3', None),
 ('London', 'United Kingdom', 'Summer', '15.7', None),
 ('London', 'United Kingdom', 'Fall', '10.4', None),
 ('Cairo', 'Egypt', 'Winter', '13.6', None),
 ('Cairo', 'Egypt', 'Spring', '20.7', None),
 ('Cairo', 'Egypt', 'Summer', '27.7', None),
 ('Cairo', 'Egypt', 'Fall', '22.2', None)]

In [23]:
%sql UPDATE COUNTRYNAME set Rainfall='5.9' WHERE Temparature='24.8';
%sql UPDATE COUNTRYNAME set Rainfall='16.2' WHERE Temparature='28.4 ';
%sql UPDATE COUNTRYNAME set Rainfall='1549.4' WHERE Temparature='27.9';
%sql UPDATE COUNTRYNAME set Rainfall='346.0' WHERE Temparature='27.6 ';
%sql UPDATE COUNTRYNAME set Rainfall='207.7 ' WHERE Temparature='4.2';
%sql UPDATE COUNTRYNAME set Rainfall='169.6 ' WHERE Temparature='8.3';
%sql UPDATE COUNTRYNAME set Rainfall='157.0' WHERE Temparature='15.7';
%sql UPDATE COUNTRYNAME set Rainfall='218.5 ' WHERE Temparature='10.4';
%sql UPDATE COUNTRYNAME set Rainfall='16.5' WHERE Temparature='13.6';
%sql UPDATE COUNTRYNAME set Rainfall='6.5' WHERE Temparature='27.1';
%sql UPDATE COUNTRYNAME set Rainfall='0.1' WHERE Temparature='27.7';
%sql UPDATE COUNTRYNAME set Rainfall='4.5 ' WHERE Temparature='22.2';

 * sqlite://
1 rows affected.
 * sqlite://
0 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
0 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
0 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [26]:
%sql select Temparature from COUNTRYNAME;

 * sqlite://
Done.

[('24.8',),
 ('28.4',),
 ('27.9',),
 ('27.6',),
 ('4.2',),
 ('8.3',),
 ('15.7',),
 ('10.4',),
 ('13.6',),
 ('20.7',),
 ('27.7',),
 ('22.2',)]

In [29]:
%sql SELECT DISTINCT city from COUNTRYNAME;

 * sqlite://
Done.

[('Munbai',), ('London',), ('Cairo',)]

In [30]:
%sql select * from COUNTRYNAME where country='India';

 * sqlite://
Done.

[('Munbai', 'India', 'Winter', '24.8', '5.9'),
 ('Munbai', 'India', 'Spring', '28.4', None),
 ('Munbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Munbai', 'India', 'Fall', '27.6', None)]

In [31]:
%sql select city,country,season from COUNTRYNAME where rainfall BETWEEN 200 AND 400

 * sqlite://
Done.

[('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall'),
 ('Cairo', 'Egypt', 'Fall')]

In [33]:
%sql select city,country from COUNTRYNAME where Temparature >20 order by Temparature ASC;

 * sqlite://
Done.

[('London', 'United Kingdom'),
 ('Cairo', 'Egypt'),
 ('London', 'United Kingdom'),
 ('Cairo', 'Egypt'),
 ('Cairo', 'Egypt'),
 ('Munbai', 'India'),
 ('Munbai', 'India'),
 ('Cairo', 'Egypt'),
 ('Munbai', 'India'),
 ('Munbai', 'India'),
 ('London', 'United Kingdom'),
 ('London', 'United Kingdom')]

In [34]:
%sql SELECT count(rainfall) from COUNTRYNAME where city='Cairo';

 * sqlite://
Done.

[(3,)]